Revit 2027 API
PolyLine.GetCoordinate Method
Gets the coordinate point of the specified index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetCoordinate(
	int index
)
Public Function GetCoordinate (
	index As Integer
) As XYZ
public:
XYZ^ GetCoordinate(
	int index
)
member GetCoordinate :
        index : int -> XYZ
Parameters
index Int32
The index of the coordinates.
Return Value
XYZ
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the index value is out of range.
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace